radiobillm/DakotaSim/arduino/boards.txt
##############################################################

micro.name=Arduino Micro

micro.vid.0=0x2341
micro.pid.0=0x8037

micro.upload_port.0.vid=0x2341
micro.upload_port.0.pid=0x8037


micro.upload.tool=avrdude
micro.upload.tool.default=avrdude
micro.upload.tool.network=arduino_ota
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.tool.default=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb
micro.bootloader.file=caterina/Caterina-Micro.hex
micro.bootloader.unlock_bits=0x3F
micro.bootloader.lock_bits=0x2F

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=AVR_MICRO
micro.build.core=arduino
micro.build.variant=micro
micro.build.extra_flags={build.usb_flags}

micro0.name=Arduino Throttle

micro0.vid.0=0x2341
micro0.pid.0=0x0035

micro0.upload_port.0.vid=0x2341
micro0.upload_port.0.pid=0x0035

micro0.upload.tool=avrdude
micro0.upload.tool.default=avrdude
micro0.upload.tool.network=arduino_ota
micro0.upload.protocol=avr109
micro0.upload.maximum_size=28672
micro0.upload.maximum_data_size=2560
micro0.upload.speed=57600
micro0.upload.disable_flushing=true
micro0.upload.use_1200bps_touch=true
micro0.upload.wait_for_upload_port=true

micro0.bootloader.tool=avrdude
micro0.bootloader.tool.default=avrdude
micro0.bootloader.low_fuses=0xff
micro0.bootloader.high_fuses=0xd8
micro0.bootloader.extended_fuses=0xcb
micro0.bootloader.file=caterina/Caterina-micro.hex
micro0.bootloader.unlock_bits=0x3F
micro0.bootloader.lock_bits=0x2F

micro0.build.mcu=atmega32u4
micro0.build.f_cpu=16000000L
micro0.build.vid=0x2341
micro0.build.pid=0x0035
micro0.build.usb_product="Throttle"
micro0.build.board=AVR_MICRO
micro0.build.core=arduino
micro0.build.variant=micro
micro0.build.extra_flags={build.usb_flags}


####
micro1.name=Arduino Trim

micro1.vid.0=0x2341
micro1.pid.0=0x0038

micro1.upload_port.0.vid=0x2341
micro1.upload_port.0.pid=0x0038

micro1.upload.tool=avrdude
micro1.upload.tool.default=avrdude
micro1.upload.tool.network=arduino_ota
micro1.upload.protocol=avr109
micro1.upload.maximum_size=28672
micro1.upload.maximum_data_size=2560
micro1.upload.speed=57600
micro1.upload.disable_flushing=true
micro1.upload.use_1200bps_touch=true
micro1.upload.wait_for_upload_port=true

micro1.bootloader.tool=avrdude
micro1.bootloader.tool.default=avrdude
micro1.bootloader.low_fuses=0xff
micro1.bootloader.high_fuses=0xd8
micro1.bootloader.extended_fuses=0xcb
micro1.bootloader.file=caterina/Caterina-micro.hex
micro1.bootloader.unlock_bits=0x3F
micro1.bootloader.lock_bits=0x2F

micro1.build.mcu=atmega32u4
micro1.build.f_cpu=16000000L
micro1.build.vid=0x2341
micro1.build.pid=0x8038
micro1.build.usb_product="Trim"
micro1.build.board=AVR_MICRO
micro1.build.core=arduino
micro1.build.variant=micro
micro1.build.extra_flags={build.usb_flags}

####
micro2.name=Arduino Key

micro2.vid.0=0x2341
micro2.pid.0=0x0039

micro2.upload_port.0.vid=0x2341
micro2.upload_port.0.pid=0x0039

micro2.upload.tool=avrdude
micro2.upload.tool.default=avrdude
micro2.upload.tool.network=arduino_ota
micro2.upload.protocol=avr109
micro2.upload.maximum_size=28672
micro2.upload.maximum_data_size=2560
micro2.upload.speed=57600
micro2.upload.disable_flushing=true
micro2.upload.use_1200bps_touch=true
micro2.upload.wait_for_upload_port=true

micro2.bootloader.tool=avrdude
micro2.bootloader.tool.default=avrdude
micro2.bootloader.low_fuses=0xff
micro2.bootloader.high_fuses=0xd8
micro2.bootloader.extended_fuses=0xcb
micro2.bootloader.file=caterina/Caterina-micro.hex
micro2.bootloader.unlock_bits=0x3F
micro2.bootloader.lock_bits=0x2F

micro2.build.mcu=atmega32u4
micro2.build.f_cpu=16000000L
micro2.build.vid=0x2341
micro2.build.pid=0x8039
micro2.build.usb_product="Key"
micro2.build.board=AVR_MICRO
micro2.build.core=arduino
micro2.build.variant=micro
micro2.build.extra_flags={build.usb_flags}


##############################################################

esplora.name=Arduino Esplora
esplora.vid.0=0x2341
esplora.pid.0=0x003C
esplora.vid.1=0x2341
esplora.pid.1=0x803C
esplora.vid.2=0x2A03
esplora.pid.2=0x003C
esplora.vid.3=0x2A03
esplora.pid.3=0x803C
esplora.upload_port.0.vid=0x2341
esplora.upload_port.0.pid=0x003C
esplora.upload_port.1.vid=0x2341
esplora.upload_port.1.pid=0x803C
esplora.upload_port.2.vid=0x2A03
esplora.upload_port.2.pid=0x003C
esplora.upload_port.3.vid=0x2A03
esplora.upload_port.3.pid=0x803C
esplora.upload_port.4.board=esplora

esplora.upload.tool=avrdude
esplora.upload.tool.default=avrdude
esplora.upload.tool.network=arduino_ota
esplora.upload.protocol=avr109
esplora.upload.maximum_size=28672
esplora.upload.maximum_data_size=2560
esplora.upload.speed=57600
esplora.upload.disable_flushing=true
esplora.upload.use_1200bps_touch=true
esplora.upload.wait_for_upload_port=true

esplora.bootloader.tool=avrdude
esplora.bootloader.tool.default=avrdude
esplora.bootloader.low_fuses=0xff
esplora.bootloader.high_fuses=0xd8
esplora.bootloader.extended_fuses=0xcb
esplora.bootloader.file=caterina/Caterina-Esplora.hex
esplora.bootloader.unlock_bits=0x3F
esplora.bootloader.lock_bits=0x2F

esplora.build.mcu=atmega32u4
esplora.build.f_cpu=16000000L
esplora.build.vid=0x2341
esplora.build.pid=0x803c
esplora.build.usb_product="Arduino Esplora"
esplora.build.board=AVR_ESPLORA
esplora.build.core=arduino
esplora.build.variant=leonardo
esplora.build.extra_flags={build.usb_flags}

##############################################################

mini.name=Arduino Mini

mini.upload_port.0.board=mini

mini.upload.tool=avrdude
mini.upload.tool.default=avrdude
mini.upload.tool.network=arduino_ota
mini.upload.protocol=arduino

mini.bootloader.tool=avrdude
mini.bootloader.tool.default=avrdude
mini.bootloader.low_fuses=0xff
mini.bootloader.unlock_bits=0x3F
mini.bootloader.lock_bits=0x0F

mini.build.f_cpu=16000000L
mini.build.board=AVR_MINI
mini.build.core=arduino
mini.build.variant=eightanaloginputs

## Arduino Mini w/ ATmega328P
## --------------------------
mini.menu.cpu.atmega328=ATmega328P

mini.menu.cpu.atmega328.upload.maximum_size=28672
mini.menu.cpu.atmega328.upload.maximum_data_size=2048
mini.menu.cpu.atmega328.upload.speed=115200

mini.menu.cpu.atmega328.bootloader.high_fuses=0xd8
mini.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
mini.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_atmega328-Mini.hex

mini.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Mini w/ ATmega168
## -------------------------
mini.menu.cpu.atmega168=ATmega168

mini.menu.cpu.atmega168.upload.maximum_size=14336
mini.menu.cpu.atmega168.upload.maximum_data_size=1024
mini.menu.cpu.atmega168.upload.speed=19200

mini.menu.cpu.atmega168.bootloader.high_fuses=0xdd
mini.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
mini.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_ng.hex

